1/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("birth_date", "created_at", "name", "sex", "titles", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["birth_date", Fri, 25 Feb 1323], ["created_at", Thu, 05 Jun 2014 09:07:59 UTC +00:00], ["name", "sdsds"], ["sex", "male"], ["titles", ""], ["updated_at", Thu, 05 Jun 2014 09:07:59 UTC +00:00]]
---
  def create
    @dog= Dog.new(dog_params)
    if @dog.save

UPDATE "dogs" SET "titles" = ?, "sex" = ?, "birth_date" = ?, "updated_at" = ? WHERE "dogs"."id" = 2  [["titles", ""], ["sex", "Male"], ["birth_date", Wed, 25 Apr 2007], ["updated_at", Mon, 02 Jun 2014 11:54:36 UTC +00:00]]
---
  def update
    if @dog.update_attributes(dog_params)

DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 5]]
---
  def destroy
    @dog.destroy